/*
#############################################
## export invoice ass csv file
#############################################
*/ 
        function exportToCSV() {
            // Define the data
            var data = [
                ['مطعم برو'],
                ['موعد الطلب:', '10/2/2024 : 12:30 PM'],
                ['رقم الطلب:', '2334412'],
                ['نوع الطلب:', 'داخل المطعم'],
                ['رقم الوحدة:', '320'],
                ['اسم العميل:', '2334412'],
                ['رقم الجوال:', '9099939393'],
                ['الصنف', 'الكمية', 'الاضافات', 'السعر'],
                ['اسم الصنف', 3, '-', 24],
                ['اسم الصنف', 44, '-', 4],
                ['اسم الصنف', 5, '-', 21],
                ['المجموع:', '120ريال'],
                ['ضريبة القيمة المضافة:', '10ريال'],
                ['الاجمالى:', '220ريال']
            ];

            // Create a new workbook and worksheet
            var wb = XLSX.utils.book_new();
            var ws = XLSX.utils.aoa_to_sheet(data);

            // Add the worksheet to the workbook
            XLSX.utils.book_append_sheet(wb, ws, 'Invoice');

            // Export the workbook to a CSV file
            XLSX.writeFile(wb, 'invoice.csv', { bookType: 'csv' });
        }

        //  ##### export tables to csv format  for : offer page
        function exportOfferToCSV() {
            // Define the data
            var data = [
                ['صورة العرض','وصف العرض', 'discription', 'تاريخ بداية العرض','تاريخ نهاية العرض' ,'الخصم', 'الاجراءات' ],
                ['', 'الوصف بالعربية', 'Discription of the arabic offer hear', ' 16 يونيو, 2026 , 12:00 ',' 20 مايو, 2026 , 12:00 ' , '36%' , 'مفعل' ], 
                ['', 'الوصف بالعربية', 'Discription of the arabic offer hear', ' 16 يونيو, 2026 , 12:00 ',' 20 مايو, 2026 , 12:00 ' , '36%' , 'مفعل' ], 
                ['', 'الوصف بالعربية', 'Discription of the arabic offer hear', ' 16 يونيو, 2026 , 12:00 ',' 20 مايو, 2026 , 12:00 ' , '36%' , 'مفعل' ], 
                ['', 'الوصف بالعربية', 'Discription of the arabic offer hear', ' 16 يونيو, 2026 , 12:00 ',' 20 مايو, 2026 , 12:00 ' , '36%' , 'مفعل' ], 
                ['', 'الوصف بالعربية', 'Discription of the arabic offer hear', ' 16 يونيو, 2026 , 12:00 ',' 20 مايو, 2026 , 12:00 ' , '36%' , 'مفعل' ], 
                ['', 'الوصف بالعربية', 'Discription of the arabic offer hear', ' 16 يونيو, 2026 , 12:00 ',' 20 مايو, 2026 , 12:00 ' , '36%' , 'مفعل' ], 
                ['', 'الوصف بالعربية', 'Discription of the arabic offer hear', ' 16 يونيو, 2026 , 12:00 ',' 20 مايو, 2026 , 12:00 ' , '36%' , 'مفعل' ], 
                ['', 'الوصف بالعربية', 'Discription of the arabic offer hear', ' 16 يونيو, 2026 , 12:00 ',' 20 مايو, 2026 , 12:00 ' , '36%' , 'مفعل' ], 
                ['', 'الوصف بالعربية', 'Discription of the arabic offer hear', ' 16 يونيو, 2026 , 12:00 ',' 20 مايو, 2026 , 12:00 ' , '36%' , 'مفعل' ], 
                ['', 'الوصف بالعربية', 'Discription of the arabic offer hear', ' 16 يونيو, 2026 , 12:00 ',' 20 مايو, 2026 , 12:00 ' , '36%' , 'مفعل' ], 
                ['', 'الوصف بالعربية', 'Discription of the arabic offer hear', ' 16 يونيو, 2026 , 12:00 ',' 20 مايو, 2026 , 12:00 ' , '36%' , 'مفعل' ], 
                ['', 'الوصف بالعربية', 'Discription of the arabic offer hear', ' 16 يونيو, 2026 , 12:00 ',' 20 مايو, 2026 , 12:00 ' , '36%' , 'مفعل' ], 
                ['', 'الوصف بالعربية', 'Discription of the arabic offer hear', ' 16 يونيو, 2026 , 12:00 ',' 20 مايو, 2026 , 12:00 ' , '36%' , 'مفعل' ], 
            ];
        
            // Create a new workbook and worksheet
            var wb = XLSX.utils.book_new();
            var ws = XLSX.utils.aoa_to_sheet(data);
        
            // Add the worksheet to the workbook
            XLSX.utils.book_append_sheet(wb, ws, 'offer');
        
            // Export the workbook to a CSV file
            XLSX.writeFile(wb, 'offer.csv', { bookType: 'csv' });
        }
        //  ##### export tables to csv format  for : categorys page
        function exportCategorysToCSV() {
            // Define the data
            var data = [
                ['صورة العرض', 'اسم القسم', 'section name','عدد الاصناف' , 'الاجراءات' ],
                    [ '--', 'السلطات والخضروات', 'salade and vegetables', ' 25',' مفعل'  ],
                    [ '--', 'المقبلات والمعجنات', 'salade and vegetables', ' 25',' مفعل' ],
                    [ '--', 'المقبلات والمعجنات', 'salade and vegetables', ' 25',' مفعل'  ],
                    [ '--', 'المقبلات والمعجنات', 'salade and vegetables', ' 25',' مفعل'  ],
                    [ '--', 'المقبلات والمعجنات', 'salade and vegetables', ' 25',' مفعل'  ],
                    [ '--', 'المقبلات والمعجنات', 'salade and vegetables', ' 25',' مفعل'  ],
                    [ '--', 'المقبلات والمعجنات', 'salade and vegetables', ' 25',' مفعل'  ],
                    [ '--', 'المقبلات والمعجنات', 'salade and vegetables', ' 25',' مفعل'  ],
                    [ '--', 'المقبلات والمعجنات', 'salade and vegetables', ' 25',' مفعل'  ],
            ];
        
            // Create a new workbook and worksheet
            var wb = XLSX.utils.book_new();
            var ws = XLSX.utils.aoa_to_sheet(data);
        
            // Add the worksheet to the workbook
            XLSX.utils.book_append_sheet(wb, ws, '');
        
            // Export the workbook to a CSV file
            XLSX.writeFile(wb, 'categores.csv', { bookType: 'csv' });
        }
        //  ##### export tables to csv format  for : categorize page
        function exportcategorizeToCSV() {
            // Define the data
            var data = [
                ['صورة العرض', 'اسم الصنف', 'item name','القسم', 'السعر' ,'مفضلة', 'الاجراءات' ],
                [ '--', 'السلطات والخضروات', 'salade and vegetables','القسم رقم1', ' 25 ريال','43', 'منتهي'  ],
                [ '--', 'السلطات والخضروات', 'salade and vegetables','القسم رقم1', ' 25 ريال','43', 'منتهي'  ],
                [ '--', 'السلطات والخضروات', 'salade and vegetables','القسم رقم1', ' 25 ريال','43', 'منتهي'  ],
                [ '--', 'السلطات والخضروات', 'salade and vegetables','القسم رقم1', ' 25 ريال','43', 'منتهي'  ],
                [ '--', 'السلطات والخضروات', 'salade and vegetables','القسم رقم1', ' 25 ريال','43', 'منتهي'  ],
                [ '--', 'السلطات والخضروات', 'salade and vegetables','القسم رقم1', ' 25 ريال','43', 'منتهي'  ],
                [ '--', 'السلطات والخضروات', 'salade and vegetables','القسم رقم1', ' 25 ريال','43', 'منتهي'  ],
                [ '--', 'السلطات والخضروات', 'salade and vegetables','القسم رقم1', ' 25 ريال','43', 'منتهي'  ],
                [ '--', 'السلطات والخضروات', 'salade and vegetables','القسم رقم1', ' 25 ريال','43', 'منتهي'  ],
                [ '--', 'السلطات والخضروات', 'salade and vegetables','القسم رقم1', ' 25 ريال','43', 'منتهي'  ],
                [ '--', 'السلطات والخضروات', 'salade and vegetables','القسم رقم1', ' 25 ريال','43', 'منتهي'  ],
                [ '--', 'السلطات والخضروات', 'salade and vegetables','القسم رقم1', ' 25 ريال','43', 'منتهي'  ],
                [ '--', 'السلطات والخضروات', 'salade and vegetables','القسم رقم1', ' 25 ريال','43', 'منتهي'  ],
                [ '--', 'السلطات والخضروات', 'salade and vegetables','القسم رقم1', ' 25 ريال','43', 'منتهي'  ],
                
            ];
        
            // Create a new workbook and worksheet
            var wb = XLSX.utils.book_new();
            var ws = XLSX.utils.aoa_to_sheet(data);
        
            // Add the worksheet to the workbook
            XLSX.utils.book_append_sheet(wb, ws, '');
        
            // Export the workbook to a CSV file
            XLSX.writeFile(wb, 'categorize.csv', { bookType: 'csv' });
        }
        //  ##### export tables to csv format  for : archive-order page
        function exportarchivorderToCSV() {
            // Define the data
            var data = [
                ['رقم الطلب', 'بيانات الموظف', 'اسم العميل','الفرع', 'طريقة الدفع' ,'حالة الطلب','الاجمالى', 'تاريخ الطلب',  'الاجراءات' ],
                ['43356', 'محمد عبد الحميد', ' +23 993883993-اسم العميل ل','الرياض-الرئيسي-شارع صاري', 'مدى' ,' ملغي','120 ريال', '2022,مايو,15 12:20م',  '-----' ],
                ['43356', 'محمد عبد الحميد', ' +23 993883993-اسم العميل ل','الرياض-الرئيسي-شارع صاري', 'فيزا' ,' ملغي','120 ريال', '2022,مايو,15 12:20م',  '-----' ],
                ['43356', 'محمد عبد الحميد', ' +23 993883993-اسم العميل ل','الرياض-الرئيسي-شارع صاري', 'قوقل باي' ,' ملغي','120 ريال', '2022,مايو,15 12:20م',  '-----' ],
                ['43356', 'محمد عبد الحميد', ' +23 993883993-اسم العميل ل','الرياض-الرئيسي-شارع صاري', 'كاش' ,' ملغي','120 ريال', '2022,مايو,15 12:20م',  '-----' ],
                ['43356', 'محمد عبد الحميد', ' +23 993883993-اسم العميل ل','الرياض-الرئيسي-شارع صاري', 'حوالة بنكية' ,' ملغي','120 ريال', '2022,مايو,15 12:20م',  '-----' ],
                ['43356', 'محمد عبد الحميد', ' +23 993883993-اسم العميل ل','الرياض-الرئيسي-شارع صاري', 'ابل باى' ,' ملغي','120 ريال', '2022,مايو,15 12:20م',  '-----' ],
                ['43356', 'محمد عبد الحميد', ' +23 993883993-اسم العميل ل','الرياض-الرئيسي-شارع صاري', 'تمارا' ,' ملغي','120 ريال', '2022,مايو,15 12:20م',  '-----' ],
                ['43356', 'محمد عبد الحميد', ' +23 993883993-اسم العميل ل','الرياض-الرئيسي-شارع صاري', 'ماستر كارد' ,' ملغي','120 ريال', '2022,مايو,15 12:20م',  '-----' ],
                ['43356', 'محمد عبد الحميد', ' +23 993883993-اسم العميل ل','الرياض-الرئيسي-شارع صاري', 'مدى' ,' ملغي','120 ريال', '2022,مايو,15 12:20م',  '-----' ],
                ['43356', 'محمد عبد الحميد', ' +23 993883993-اسم العميل ل','الرياض-الرئيسي-شارع صاري', 'نقدا' ,' ملغي','120 ريال', '2022,مايو,15 12:20م',  '-----' ],
                ['43356', 'محمد عبد الحميد', ' +23 993883993-اسم العميل ل','الرياض-الرئيسي-شارع صاري', 'مدى' ,' ملغي','120 ريال', '2022,مايو,15 12:20م',  '-----' ],
                ['43356', 'محمد عبد الحميد', ' +23 993883993-اسم العميل ل','الرياض-الرئيسي-شارع صاري', 'مدى' ,' ملغي','120 ريال', '2022,مايو,15 12:20م',  '-----' ],
                ['43356', 'محمد عبد الحميد', ' +23 993883993-اسم العميل ل','الرياض-الرئيسي-شارع صاري', 'مدى' ,' ملغي','120 ريال', '2022,مايو,15 12:20م',  '-----' ],
                ['43356', 'محمد عبد الحميد', ' +23 993883993-اسم العميل ل','الرياض-الرئيسي-شارع صاري', 'مدى' ,' ملغي','120 ريال', '2022,مايو,15 12:20م',  '-----' ],
                
            ];
        
            // Create a new workbook and worksheet
            var wb = XLSX.utils.book_new();
            var ws = XLSX.utils.aoa_to_sheet(data);
        
            // Add the worksheet to the workbook
            XLSX.utils.book_append_sheet(wb, ws, '');
        
            // Export the workbook to a CSV file
            XLSX.writeFile(wb, 'archive-order.csv', { bookType: 'csv' });
        }
        //  ##### export tables to csv format  for : new-order page
        function exportneworderToCSV() {
            // Define the data
            var data = [
                ['رقم الطلب', 'بيانات العميل','الفرع', 'طريقة الدفع' ,'تاريخ الطلب','الاجمالى', 'طريقة الاستلام','الكوبونات','حالة الطلب' ,'الاجراءات' ],
                ['43356', 'محمد عبد الحميد', 'الرياض-الرئيسي-شارع صاري', 'مدى' ,'2022,مايو,15 ', '120 ريال', 'البريد ',  ' FDSGTX ' , 'ملغي ', '---------'], 
                ['43356', 'محمد عبد الحميد', 'الرياض-الرئيسي-شارع صاري', 'فيزا' ,'2022,مايو,15 ', '120 ريال', 'البريد ',  '-----' , 'ملغي ', '---------'], 
                ['43356', 'محمد عبد الحميد', 'الرياض-الرئيسي-شارع صاري', 'ماستر' ,'2022,مايو,15 ', '120 ريال', 'البريد ',  '-----' , 'ملغي ', '---------'], 
                ['43356', 'محمد عبد الحميد', 'الرياض-الرئيسي-شارع صاري', 'تمارا' ,'2022,مايو,15 ', '120 ريال', 'البريد ',  ' FDSGTX ' , 'ملغي ', '---------'], 
                ['43356', 'محمد عبد الحميد', 'الرياض-الرئيسي-شارع صاري', 'ابل باي' ,'2022,مايو,15 ', '120 ريال', 'البريد ',  '-----' , 'ملغي ', '---------'], 
                ['43356', 'محمد عبد الحميد', 'الرياض-الرئيسي-شارع صاري', 'قوقل' ,'2022,مايو,15 ', '120 ريال', 'البريد ',  '-----' , 'ملغي ', '---------'], 
                ['43356', 'محمد عبد الحميد', 'الرياض-الرئيسي-شارع صاري', 'حوالة' ,'2022,مايو,15 ', '120 ريال', 'البريد ',  'GTRFS' , 'ملغي ', '---------'], 
                ['43356', 'محمد عبد الحميد', 'الرياض-الرئيسي-شارع صاري', 'نقدي' ,'2022,مايو,15 ', '120 ريال', 'البريد ',  '-----' , 'ملغي ', '---------'], 
                ['43356', 'محمد عبد الحميد', 'الرياض-الرئيسي-شارع صاري', 'مدى' ,'2022,مايو,15 ', '120 ريال', 'البريد ',  ' FDSGTX ' , 'ملغي ', '---------'], 
                ['43356', 'محمد عبد الحميد', 'الرياض-الرئيسي-شارع صاري', 'مدى' ,'2022,مايو,15 ', '120 ريال', 'البريد ',  '-----' , 'ملغي ', '---------'], 
                ['43356', 'محمد عبد الحميد', 'الرياض-الرئيسي-شارع صاري', 'مدى' ,'2022,مايو,15 ', '120 ريال', 'البريد ',  '-----' , 'ملغي ', '---------'], 
                ['43356', 'محمد عبد الحميد', 'الرياض-الرئيسي-شارع صاري', 'مدى' ,'2022,مايو,15 ', '120 ريال', 'البريد ',  '-----' , 'ملغي ', '---------'], 
           
            ];
        
            // Create a new workbook and worksheet
            var wb = XLSX.utils.book_new();
            var ws = XLSX.utils.aoa_to_sheet(data);
        
            // Add the worksheet to the workbook
            XLSX.utils.book_append_sheet(wb, ws, '');
        
            // Export the workbook to a CSV file
            XLSX.writeFile(wb, 'new-order.csv', { bookType: 'csv' });
        }
        //  ##### export tables to csv format  for : user managment page
        function exportusermanagmentToCSV() {
            var invoiceContent = document.getElementById('datatable6').outerHTML; 
            // Define the data
            var data = [
                ['رقم الموظف', 'اسم الكوظف','المنصب', 'تاريخ الانشاء' ,'اخر دخول','حضور الشهر', 'الساعات الاضافية ','غياب الشهر','الاجراءات' ],
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
           
            ];
        
            // Create a new workbook and worksheet
            var wb = XLSX.utils.book_new();
            var ws = XLSX.utils.aoa_to_sheet(data);
        
            // Add the worksheet to the workbook
            XLSX.utils.book_append_sheet(wb, ws, '');
        
            // Export the workbook to a CSV file
            XLSX.writeFile(wb, 'user-managment.csv', { bookType: 'csv' });
        }
        //  ##### export tables to csv format  for : user-info page
        function exporuserinfoToCSV() {
            var invoiceContent = document.getElementById('datatable7').outerHTML; 
            // Define the data
            var data = [
                ['اليوم', 'تسجيل الدخول','تسجيل الخروج', 'عدد ساعات العمل' ,'الحالة', 'ملاحظات '],
                ['01/03', ' 03:00 مساءا', '08:00 صباحا ', '9 ساعات' , 'حاضر', '---------'], 
                ['01/03', ' 03:00 مساءا', '08:00 صباحا ', '9 ساعات' , 'حاضر', '---------'], 
                ['01/03', ' 03:00 مساءا', '08:00 صباحا ', '9 ساعات' , 'حاضر', 'يتم ظهور الملاحظة هنا لإن وجد..'], 
                ['01/03', ' 03:00 مساءا', '08:00 صباحا ', '9 ساعات' , 'حاضر', '---------'], 
                ['01/03', ' 03:00 مساءا', '08:00 صباحا ', '9 ساعات' , 'حاضر', '---------'], 
                ['01/03', ' 03:00 مساءا', '08:00 صباحا ', '9 ساعات' , 'حاضر', '---------'], 
                ['01/03', ' 03:00 مساءا', '08:00 صباحا ', '9 ساعات' , 'حاضر', 'يتم ظهور الملاحظة هنا لإن وجد..'], 
                ['01/03', ' 03:00 مساءا', '08:00 صباحا ', '9 ساعات' , 'حاضر', '---------'], 
                ['01/03', ' 03:00 مساءا', '08:00 صباحا ', '9 ساعات' , 'حاضر', '---------'], 
                ['01/03', ' 03:00 مساءا', '08:00 صباحا ', '9 ساعات' , 'حاضر', '---------'], 
                ['01/03', ' 03:00 مساءا', '08:00 صباحا ', '9 ساعات' , 'حاضر', 'يتم ظهور الملاحظة هنا لإن وجد..'], 
                ['01/03', ' 03:00 مساءا', '08:00 صباحا ', '9 ساعات' , 'حاضر', '---------'], 
                ['01/03', ' 03:00 مساءا', '08:00 صباحا ', '9 ساعات' , 'حاضر', '---------'], 
                ['01/03', ' 03:00 مساءا', '08:00 صباحا ', '9 ساعات' , 'حاضر', '---------'], 
                ['01/03', ' 03:00 مساءا', '08:00 صباحا ', '9 ساعات' , 'حاضر', 'يتم ظهور الملاحظة هنا لإن وجد..'], 
                ['01/03', ' 03:00 مساءا', '08:00 صباحا ', '9 ساعات' , 'حاضر', '---------'], 
            ];
        
            // Create a new workbook and worksheet
            var wb = XLSX.utils.book_new();
            var ws = XLSX.utils.aoa_to_sheet(data);
        
            // Add the worksheet to the workbook
            XLSX.utils.book_append_sheet(wb, ws, '');
        
            // Export the workbook to a CSV file
            XLSX.writeFile(wb, 'user-info.csv', { bookType: 'csv' });
        }
        //  ##### export tables to csv format  for : clints page
        function exportclintsToCSV() {
            var invoiceContent = document.getElementById('datatable8').outerHTML; 
            // Define the data
            var data = [
                ['الاسم', 'الفرع','رقم الجزال', 'طريقة الدفع' ,'اجمالى الطلبات', 'طريقة الاستلام ', 'الكوبونات' , 'حالة الطلب '],
                ['اسم العميل', ' الرياض-الرئسي شارع صاري ', '+249 99999922', 'مدى' , '10', 'البريد' , 'PUYS44', ' تم التسليم'], 
                ['اسم العميل', ' الرياض-الرئسي شارع صاري ', '+249 99999922', 'مدى' , '10', 'البريد' , '------', ' ملغي'], 
                ['اسم العميل', ' الرياض-الرئسي شارع صاري ', '+249 99999922', 'مدى' , '10', 'البريد' , 'PUYS44', ' تم التسليم'], 
                ['اسم العميل', ' الرياض-الرئسي شارع صاري ', '+249 99999922', 'مدى' , '10', 'البريد' , '------', ' ملغي'], 
                ['اسم العميل', ' الرياض-الرئسي شارع صاري ', '+249 99999922', 'مدى' , '10', 'البريد' , 'PUYS44', ' تم التسليم'], 
                ['اسم العميل', ' الرياض-الرئسي شارع صاري ', '+249 99999922', 'مدى' , '10', 'البريد' , '------', ' ملغي'], 
                ['اسم العميل', ' الرياض-الرئسي شارع صاري ', '+249 99999922', 'مدى' , '10', 'البريد' , 'PUYS44', ' تم التسليم'], 
                ['اسم العميل', ' الرياض-الرئسي شارع صاري ', '+249 99999922', 'مدى' , '10', 'البريد' , '------', ' ملغي'], 
                ['اسم العميل', ' الرياض-الرئسي شارع صاري ', '+249 99999922', 'مدى' , '10', 'البريد' , 'PUYS44', ' تم التسليم'], 
                ['اسم العميل', ' الرياض-الرئسي شارع صاري ', '+249 99999922', 'مدى' , '10', 'البريد' , '------', ' ملغي'], 
                ['اسم العميل', ' الرياض-الرئسي شارع صاري ', '+249 99999922', 'مدى' , '10', 'البريد' , 'PUYS44', ' تم التسليم'], 
                ['اسم العميل', ' الرياض-الرئسي شارع صاري ', '+249 99999922', 'مدى' , '10', 'البريد' , '------', ' ملغي'], 
                ['اسم العميل', ' الرياض-الرئسي شارع صاري ', '+249 99999922', 'مدى' , '10', 'البريد' , 'PUYS44', ' تم التسليم'], 
                ['اسم العميل', ' الرياض-الرئسي شارع صاري ', '+249 99999922', 'مدى' , '10', 'البريد' , '------', ' ملغي'], 
               
            ];
        
            // Create a new workbook and worksheet
            var wb = XLSX.utils.book_new();
            var ws = XLSX.utils.aoa_to_sheet(data);
        
            // Add the worksheet to the workbook
            XLSX.utils.book_append_sheet(wb, ws, '');
        
            // Export the workbook to a CSV file
            XLSX.writeFile(wb, 'clints.csv', { bookType: 'csv' });
        }
        
        //  ##### export tables to csv format  for : rattings page
        function exportratingToCSV() {
            var invoiceContent = document.getElementById('datatable9').outerHTML; 
            // Define the data
            var data = [
                ['رقم الطلب', 'الاسم','الاجمالي', 'الفرع' ,'التقييم العام'],
                ['23232', ' بيرقر هيتا الاصلى المميز الجدي  اضافات:فلافل عادي: بابا غنوج عادي:اسكندراني عادي ', 'اجمالى  3434', 'الفرع الئيسي' , '4.0', ], 
                ['23232', ' بيرقر هيتا الاصلى المميز الجدي  اضافات:فلافل عادي: بابا غنوج عادي:اسكندراني عادي ', 'اجمالى  3434', 'الفرع الئيسي' , '4.0', ], 
                ['23232', ' بيرقر هيتا الاصلى المميز الجدي  اضافات:فلافل عادي: بابا غنوج عادي:اسكندراني عادي ', 'اجمالى  3434', 'الفرع الئيسي' , '4.0', ], 
                ['23232', ' بيرقر هيتا الاصلى المميز الجدي  اضافات:فلافل عادي: بابا غنوج عادي:اسكندراني عادي ', 'اجمالى  3434', 'الفرع الئيسي' , '4.0', ], 
                ['23232', ' بيرقر هيتا الاصلى المميز الجدي  اضافات:فلافل عادي: بابا غنوج عادي:اسكندراني عادي ', 'اجمالى  3434', 'الفرع الئيسي' , '4.0', ], 
                ['23232', ' بيرقر هيتا الاصلى المميز الجدي  اضافات:فلافل عادي: بابا غنوج عادي:اسكندراني عادي ', 'اجمالى  3434', 'الفرع الئيسي' , '4.0', ], 
                ['23232', ' بيرقر هيتا الاصلى المميز الجدي  اضافات:فلافل عادي: بابا غنوج عادي:اسكندراني عادي ', 'اجمالى  3434', 'الفرع الئيسي' , '4.0', ], 
                ['23232', ' بيرقر هيتا الاصلى المميز الجدي  اضافات:فلافل عادي: بابا غنوج عادي:اسكندراني عادي ', 'اجمالى  3434', 'الفرع الئيسي' , '4.0', ], 
                ['23232', ' بيرقر هيتا الاصلى المميز الجدي  اضافات:فلافل عادي: بابا غنوج عادي:اسكندراني عادي ', 'اجمالى  3434', 'الفرع الئيسي' , '4.0', ], 
                ['23232', ' بيرقر هيتا الاصلى المميز الجدي  اضافات:فلافل عادي: بابا غنوج عادي:اسكندراني عادي ', 'اجمالى  3434', 'الفرع الئيسي' , '4.0', ], 
                ['23232', ' بيرقر هيتا الاصلى المميز الجدي  اضافات:فلافل عادي: بابا غنوج عادي:اسكندراني عادي ', 'اجمالى  3434', 'الفرع الئيسي' , '4.0', ], 
            ];
        
            // Create a new workbook and worksheet
            var wb = XLSX.utils.book_new();
            var ws = XLSX.utils.aoa_to_sheet(data);
        
            // Add the worksheet to the workbook
            XLSX.utils.book_append_sheet(wb, ws, '');
        
            // Export the workbook to a CSV file
            XLSX.writeFile(wb, 'ratting.csv', { bookType: 'csv' });
        }
        //  ##### export tables to csv format  for : cobon page
        function exportcobonToCSV() {
            var invoiceContent = document.getElementById('datatable10').outerHTML; 
            // Define the data
            var data = [
                ['الرقم', 'اسم القسيمة','الكود', 'تاريخ البدء' ,'تاريخ الانتهاء','نسبة\ثابت','قيمة الخصم','قيمة الخصم فوق','المستخدمين','الاجراءات'],
                ['23232', ' اسم قسيمة راس السنة ', 'gaza', '2022,مايو,15 ' , '2022,مايو,15 ','مئوية','20%','130 رايال','120','مفعل','' ], 
                ['23232', ' اسم قسيمة راس السنة ', 'gaza', '2022,مايو,15 ' , '2022,مايو,15 ','ثابتة','20%','130 رايال','120','غير مفعل','' ], 
                ['23232', ' اسم قسيمة راس السنة ', 'gaza', '2022,مايو,15 ' , '2022,مايو,15 ','مئوية','20%','130 رايال','120','مفعل','' ], 
                ['23232', ' اسم قسيمة راس السنة ', 'gaza', '2022,مايو,15 ' , '2022,مايو,15 ','مئوية','20%','130 رايال','120','غير مفعل','' ], 
                ['23232', ' اسم قسيمة راس السنة ', 'gaza', '2022,مايو,15 ' , '2022,مايو,15 ','ثابتة','20%','130 رايال','120','مفعل','' ], 
                ['23232', ' اسم قسيمة راس السنة ', 'gaza', '2022,مايو,15 ' , '2022,مايو,15 ','مئوية','20%','130 رايال','120','غير مفعل','' ], 
                ['23232', ' اسم قسيمة راس السنة ', 'gaza', '2022,مايو,15 ' , '2022,مايو,15 ','ثابتة','20%','130 رايال','120','مفعل','' ], 
                ['23232', ' اسم قسيمة راس السنة ', 'gaza', '2022,مايو,15 ' , '2022,مايو,15 ','مئوية','20%','130 رايال','120','مفعل','' ], 
                ['23232', ' اسم قسيمة راس السنة ', 'gaza', '2022,مايو,15 ' , '2022,مايو,15 ','ثابتة','20%','130 رايال','120','مفعل','' ], 
                ['23232', ' اسم قسيمة راس السنة ', 'gaza', '2022,مايو,15 ' , '2022,مايو,15 ','ثابتة','20%','130 رايال','120','غير مفعل','' ], 
                ['23232', ' اسم قسيمة راس السنة ', 'gaza', '2022,مايو,15 ' , '2022,مايو,15 ','مئوية','20%','130 رايال','120','مفعل','' ], 
                
            ];
        
            // Create a new workbook and worksheet
            var wb = XLSX.utils.book_new();
            var ws = XLSX.utils.aoa_to_sheet(data);
        
            // Add the worksheet to the workbook
            XLSX.utils.book_append_sheet(wb, ws, '');
        
            // Export the workbook to a CSV file
            XLSX.writeFile(wb, 'cobon.csv', { bookType: 'csv' });
        }
        //  ##### export tables to csv format  for : new reservie page
        function exportnewreserveToCSV() {
            var invoiceContent = document.getElementById('datatable13').outerHTML; 
            // Define the data
            var data = [
                ['رقم الحجز', 'تاريخ الحجز','بيانات العميل', 'رقم الوحدة' ,'حالة الحجز','الاجراءات'],
                ['23232', ' 2022,مايو,15  ', ' +23 993883993 اسم العميل', '77 ' ,  'مؤكد', 'تاكيد الحجز - تمت الزيارة - الغاء الحجز', ], 
                ['23232', ' 2022,مايو,15  ', ' +23 993883993 اسم العميل', '77 ' ,  'في الانتظار', 'تاكيد الحجز - تمت الزيارة - الغاء الحجز', ], 
                ['23232', ' 2022,مايو,15  ', ' +23 993883993 اسم العميل', '77 ' ,  'مكتمل', 'تاكيد الحجز - تمت الزيارة - الغاء الحجز', ], 
                ['23232', ' 2022,مايو,15  ', ' +23 993883993 اسم العميل', '77 ' ,  'مؤكد', 'تاكيد الحجز - تمت الزيارة - الغاء الحجز', ], 
                ['23232', ' 2022,مايو,15  ', ' +23 993883993 اسم العميل', '77 ' ,  'في الانتظار', 'تاكيد الحجز - تمت الزيارة - الغاء الحجز', ], 
                ['23232', ' 2022,مايو,15  ', ' +23 993883993 اسم العميل', '77 ' ,  'مؤكد', 'تاكيد الحجز - تمت الزيارة - الغاء الحجز', ], 
                ['23232', ' 2022,مايو,15  ', ' +23 993883993 اسم العميل', '77 ' ,  'في الانتظار', 'تاكيد الحجز - تمت الزيارة - الغاء الحجز', ], 
                ['23232', ' 2022,مايو,15  ', ' +23 993883993 اسم العميل', '77 ' ,  'مؤكد', 'تاكيد الحجز - تمت الزيارة - الغاء الحجز', ], 
                ['23232', ' 2022,مايو,15  ', ' +23 993883993 اسم العميل', '77 ' ,  'في الانتظار', 'تاكيد الحجز - تمت الزيارة - الغاء الحجز', ], 
                ['23232', ' 2022,مايو,15  ', ' +23 993883993 اسم العميل', '77 ' ,  'مؤكد', 'تاكيد الحجز - تمت الزيارة - الغاء الحجز', ], 
                ['23232', ' 2022,مايو,15  ', ' +23 993883993 اسم العميل', '77 ' ,  'في الانتظار', 'تاكيد الحجز - تمت الزيارة - الغاء الحجز', ], 
                ['23232', ' 2022,مايو,15  ', ' +23 993883993 اسم العميل', '77 ' ,  'في الانتظار', 'تاكيد الحجز - تمت الزيارة - الغاء الحجز', ], 
                ['23232', ' 2022,مايو,15  ', ' +23 993883993 اسم العميل', '77 ' ,  'مؤكد', 'تاكيد الحجز - تمت الزيارة - الغاء الحجز', ], 
                ['23232', ' 2022,مايو,15  ', ' +23 993883993 اسم العميل', '77 ' ,  'في الانتظار', 'تاكيد الحجز - تمت الزيارة - الغاء الحجز', ],                
            ];
        
            // Create a new workbook and worksheet
            var wb = XLSX.utils.book_new();
            var ws = XLSX.utils.aoa_to_sheet(data);
        
            // Add the worksheet to the workbook
            XLSX.utils.book_append_sheet(wb, ws, '');
        
            // Export the workbook to a CSV file
            XLSX.writeFile(wb, 'new-reserve.csv', { bookType: 'csv' });
        }
        //  ##### export tables to csv format  for : old reservie page
        function exportoldreserveToCSV() {
            var invoiceContent = document.getElementById('datatable14').outerHTML; 
            // Define the data
            var data = [
                ['رقم الحجز', 'تاريخ الحجز','بيانات العميل', 'رقم الوحدة' ,'اسم الموظف','حالة الطلب'],
                ['6656556', ' 14 مايو 2024 , 12:30AM  ', ' +23 993883993 اسم العميل', '77 ' ,  ' اسم الموظف , Employee Name', 'مكتمل', ], 
                ['6656556', ' 14 مايو 2024 , 12:30AM  ', ' +23 993883993 اسم العميل', '77 ' ,  ' اسم الموظف , Employee Name', 'ملغي', ], 
                ['6656556', ' 14 مايو 2024 , 12:30AM  ', ' +23 993883993 اسم العميل', '77 ' ,  ' اسم الموظف , Employee Name', 'مكتمل', ], 
                ['6656556', ' 14 مايو 2024 , 12:30AM  ', ' +23 993883993 اسم العميل', '77 ' ,  ' اسم الموظف , Employee Name', 'ملغي', ], 
                ['6656556', ' 14 مايو 2024 , 12:30AM  ', ' +23 993883993 اسم العميل', '77 ' ,  ' اسم الموظف , Employee Name', 'مكتمل', ], 
                ['6656556', ' 14 مايو 2024 , 12:30AM  ', ' +23 993883993 اسم العميل', '77 ' ,  ' اسم الموظف , Employee Name', 'ملغي', ], 
                ['6656556', ' 14 مايو 2024 , 12:30AM  ', ' +23 993883993 اسم العميل', '77 ' ,  ' اسم الموظف , Employee Name', 'مكتمل', ], 
                ['6656556', ' 14 مايو 2024 , 12:30AM  ', ' +23 993883993 اسم العميل', '77 ' ,  ' اسم الموظف , Employee Name', 'ملغي', ], 
                ['6656556', ' 14 مايو 2024 , 12:30AM  ', ' +23 993883993 اسم العميل', '77 ' ,  ' اسم الموظف , Employee Name', 'مكتمل', ], 
                ['6656556', ' 14 مايو 2024 , 12:30AM  ', ' +23 993883993 اسم العميل', '77 ' ,  ' اسم الموظف , Employee Name', 'ملغي', ],                
            ];
        
            // Create a new workbook and worksheet
            var wb = XLSX.utils.book_new();
            var ws = XLSX.utils.aoa_to_sheet(data);
        
            // Add the worksheet to the workbook
            XLSX.utils.book_append_sheet(wb, ws, '');
        
            // Export the workbook to a CSV file
            XLSX.writeFile(wb, 'old-reserve.csv', { bookType: 'csv' });
        }
/*
#############################################
## export invoice ass xlex file #############
#############################################
*/ 
    // ##### export to xlex for : tableone offer-page
        function exportToExcelofferPage() {
            var invoiceContent = document.getElementById('datatable-1').outerHTML;
        
            // Convert the HTML content to a worksheet
            var wb = XLSX.utils.book_new();
            var ws = XLSX.utils.aoa_to_sheet([
        
                ['وصف العرض', 'discription', 'تاريخ بداية العرض','تاريخ نهاية العرض' ,'الخصم', 'الاجراءات' ],
                ['الوصف بالعربية', 'Discription of the arabic offer hear', ' 16 يونيو, 2026 , 12:00 ',' 20 مايو, 2026 , 12:00 ' , '36%' , 'مفعل' ],
                ['الوصف بالعربية', 'Discription of the arabic offer hear', ' 16 يونيو, 2026 , 12:00 ',' 20 مايو, 2026 , 12:00 ' , '36%' , 'غير مفعل' ],
                ['الوصف بالعربية', 'Discription of the arabic offer hear', ' 16 يونيو, 2026 , 12:00 ',' 20 مايو, 2026 , 12:00 ' , '36%' , 'مفعل' ],
                ['الوصف بالعربية', 'Discription of the arabic offer hear', ' 16 يونيو, 2026 , 12:00 ',' 20 مايو, 2026 , 12:00 ' , '36%' , 'مفعل' ],
                ['الوصف بالعربية', 'Discription of the arabic offer hear', ' 16 يونيو, 2026 , 12:00 ',' 20 مايو, 2026 , 12:00 ' , '36%' , 'غير مفعل' ],
                ['الوصف بالعربية', 'Discription of the arabic offer hear', ' 16 يونيو, 2026 , 12:00 ',' 20 مايو, 2026 , 12:00 ' , '36%' , 'مفعل' ],
                ['الوصف بالعربية', 'Discription of the arabic offer hear', ' 16 يونيو, 2026 , 12:00 ',' 20 مايو, 2026 , 12:00 ' , '36%' , 'مفعل' ],
                ['الوصف بالعربية', 'Discription of the arabic offer hear', ' 16 يونيو, 2026 , 12:00 ',' 20 مايو, 2026 , 12:00 ' , '36%' , 'مفعل' ],
                ['الوصف بالعربية', 'Discription of the arabic offer hear', ' 16 يونيو, 2026 , 12:00 ',' 20 مايو, 2026 , 12:00 ' , '36%' , 'مفعل' ],
                
            ]);
        
            // Add the worksheet to the workbook
            XLSX.utils.book_append_sheet(wb, ws, 'offer');
        
            // Export the workbook to an Excel file
            XLSX.writeFile(wb, 'offer.xlsx');
        }
        // ######## categoriسe page ##########
        function exportToExcelcategorysPage() {
            var invoiceContent = document.getElementById('datatable3').outerHTML;
        
            // Convert the HTML content to a worksheet
            var wb = XLSX.utils.book_new();
            var ws = XLSX.utils.aoa_to_sheet([
        
                ['صورة العرض', 'اسم القسم', 'section name','عدد الاصناف' , 'الاجراءات' ],
                [ '--', 'السلطات والخضروات', 'salade and vegetables', ' 25',' مفعل'  ],
                [ '--', 'المقبلات والمعجنات', 'salade and vegetables', ' 25',' مفعل' ],
                [ '--', 'المقبلات والمعجنات', 'salade and vegetables', ' 25',' مفعل'  ],
                [ '--', 'المقبلات والمعجنات', 'salade and vegetables', ' 25',' مفعل'  ],
                [ '--', 'المقبلات والمعجنات', 'salade and vegetables', ' 25',' مفعل'  ],
                [ '--', 'المقبلات والمعجنات', 'salade and vegetables', ' 25',' مفعل'  ],
                [ '--', 'المقبلات والمعجنات', 'salade and vegetables', ' 25',' مفعل'  ],
                [ '--', 'المقبلات والمعجنات', 'salade and vegetables', ' 25',' مفعل'  ],
                [ '--', 'المقبلات والمعجنات', 'salade and vegetables', ' 25',' مفعل'  ],
                
            ]);
        
            // Add the worksheet to the workbook
            XLSX.utils.book_append_sheet(wb, ws, 'categorys');
        
            // Export the workbook to an Excel file
            XLSX.writeFile(wb, 'categorys.xlsx');
        }
        // ######## categorize page ##########
        function exportcategorize() {
            var invoiceContent = document.getElementById('datatable4').outerHTML;
        
            // Convert the HTML content to a worksheet
            var wb = XLSX.utils.book_new();
            var ws = XLSX.utils.aoa_to_sheet([
        
                ['صورة العرض', 'اسم الصنف', 'item name','القسم', 'السعر' ,'مفضلة', 'الاجراءات' ],
                [ '--', 'السلطات والخضروات', 'salade and vegetables','القسم رقم1', ' 25 ريال','43', 'منتهي'  ],
                [ '--', 'السلطات والخضروات', 'salade and vegetables','القسم رقم1', ' 25 ريال','43', 'منتهي'  ],
                [ '--', 'السلطات والخضروات', 'salade and vegetables','القسم رقم1', ' 25 ريال','43', 'منتهي'  ],
                [ '--', 'السلطات والخضروات', 'salade and vegetables','القسم رقم1', ' 25 ريال','43', 'منتهي'  ],
                [ '--', 'السلطات والخضروات', 'salade and vegetables','القسم رقم1', ' 25 ريال','43', 'منتهي'  ],
                [ '--', 'السلطات والخضروات', 'salade and vegetables','القسم رقم1', ' 25 ريال','43', 'منتهي'  ],
                [ '--', 'السلطات والخضروات', 'salade and vegetables','القسم رقم1', ' 25 ريال','43', 'منتهي'  ],
                [ '--', 'السلطات والخضروات', 'salade and vegetables','القسم رقم1', ' 25 ريال','43', 'منتهي'  ],
                [ '--', 'السلطات والخضروات', 'salade and vegetables','القسم رقم1', ' 25 ريال','43', 'منتهي'  ],
                [ '--', 'السلطات والخضروات', 'salade and vegetables','القسم رقم1', ' 25 ريال','43', 'منتهي'  ],
                [ '--', 'السلطات والخضروات', 'salade and vegetables','القسم رقم1', ' 25 ريال','43', 'منتهي'  ],
                [ '--', 'السلطات والخضروات', 'salade and vegetables','القسم رقم1', ' 25 ريال','43', 'منتهي'  ],
                [ '--', 'السلطات والخضروات', 'salade and vegetables','القسم رقم1', ' 25 ريال','43', 'منتهي'  ],
                [ '--', 'السلطات والخضروات', 'salade and vegetables','القسم رقم1', ' 25 ريال','43', 'منتهي'  ],
                
                
            ]);
        
            // Add the worksheet to the workbook
            XLSX.utils.book_append_sheet(wb, ws, 'categorize');
        
            // Export the workbook to an Excel file
            XLSX.writeFile(wb, 'categorize.xlsx');
        }
        // ######## archive order page ##########
        function exportToExcelarchivorderPage() {
            var invoiceContent = document.getElementById('datatable5').outerHTML;
        
            // Convert the HTML content to a worksheet
            var wb = XLSX.utils.book_new();
            var ws = XLSX.utils.aoa_to_sheet([
                ['رقم الطلب', 'بيانات الموظف', 'اسم العميل','الفرع', 'طريقة الدفع' ,'حالة الطلب','الاجمالى', 'تاريخ الطلب',  'الاجراءات' ],
                ['43356', 'محمد عبد الحميد', ' +23 993883993-اسم العميل ل','الرياض-الرئيسي-شارع صاري', 'مدى' ,' ملغي','120 ريال', '2022,مايو,15 12:20م',  '-----' ],
                ['43356', 'محمد عبد الحميد', ' +23 993883993-اسم العميل ل','الرياض-الرئيسي-شارع صاري', 'فيزا' ,' ملغي','120 ريال', '2022,مايو,15 12:20م',  '-----' ],
                ['43356', 'محمد عبد الحميد', ' +23 993883993-اسم العميل ل','الرياض-الرئيسي-شارع صاري', 'قوقل باي' ,' ملغي','120 ريال', '2022,مايو,15 12:20م',  '-----' ],
                ['43356', 'محمد عبد الحميد', ' +23 993883993-اسم العميل ل','الرياض-الرئيسي-شارع صاري', 'كاش' ,' ملغي','120 ريال', '2022,مايو,15 12:20م',  '-----' ],
                ['43356', 'محمد عبد الحميد', ' +23 993883993-اسم العميل ل','الرياض-الرئيسي-شارع صاري', 'حوالة بنكية' ,' ملغي','120 ريال', '2022,مايو,15 12:20م',  '-----' ],
                ['43356', 'محمد عبد الحميد', ' +23 993883993-اسم العميل ل','الرياض-الرئيسي-شارع صاري', 'ابل باى' ,' ملغي','120 ريال', '2022,مايو,15 12:20م',  '-----' ],
                ['43356', 'محمد عبد الحميد', ' +23 993883993-اسم العميل ل','الرياض-الرئيسي-شارع صاري', 'تمارا' ,' ملغي','120 ريال', '2022,مايو,15 12:20م',  '-----' ],
                ['43356', 'محمد عبد الحميد', ' +23 993883993-اسم العميل ل','الرياض-الرئيسي-شارع صاري', 'ماستر كارد' ,' ملغي','120 ريال', '2022,مايو,15 12:20م',  '-----' ],
                ['43356', 'محمد عبد الحميد', ' +23 993883993-اسم العميل ل','الرياض-الرئيسي-شارع صاري', 'مدى' ,' ملغي','120 ريال', '2022,مايو,15 12:20م',  '-----' ],
                ['43356', 'محمد عبد الحميد', ' +23 993883993-اسم العميل ل','الرياض-الرئيسي-شارع صاري', 'نقدا' ,' ملغي','120 ريال', '2022,مايو,15 12:20م',  '-----' ],
                ['43356', 'محمد عبد الحميد', ' +23 993883993-اسم العميل ل','الرياض-الرئيسي-شارع صاري', 'مدى' ,' ملغي','120 ريال', '2022,مايو,15 12:20م',  '-----' ],
                ['43356', 'محمد عبد الحميد', ' +23 993883993-اسم العميل ل','الرياض-الرئيسي-شارع صاري', 'مدى' ,' ملغي','120 ريال', '2022,مايو,15 12:20م',  '-----' ],
                ['43356', 'محمد عبد الحميد', ' +23 993883993-اسم العميل ل','الرياض-الرئيسي-شارع صاري', 'مدى' ,' ملغي','120 ريال', '2022,مايو,15 12:20م',  '-----' ],
                ['43356', 'محمد عبد الحميد', ' +23 993883993-اسم العميل ل','الرياض-الرئيسي-شارع صاري', 'مدى' ,' ملغي','120 ريال', '2022,مايو,15 12:20م',  '-----' ],
                
                
            ]);
        
            // Add the worksheet to the workbook
            XLSX.utils.book_append_sheet(wb, ws, 'categorize');
        
            // Export the workbook to an Excel file
            XLSX.writeFile(wb, 'archive-order.xlsx');
        }
        // ######## new order page ##########
        function exportneworderPage() {
            var invoiceContent = document.getElementById('datatable15').outerHTML;
        
            // Convert the HTML content to a worksheet
            var wb = XLSX.utils.book_new();
            var ws = XLSX.utils.aoa_to_sheet([
                ['رقم الطلب', 'بيانات العميل','الفرع', 'طريقة الدفع' ,'تاريخ الطلب','الاجمالى', 'طريقة الاستلام','الكوبونات','حالة الطلب' ,'الاجراءات' ],
                ['43356', 'محمد عبد الحميد', 'الرياض-الرئيسي-شارع صاري', 'مدى' ,'2022,مايو,15 ', '120 ريال', 'البريد ',  ' FDSGTX ' , 'ملغي ', '---------'], 
                ['43356', 'محمد عبد الحميد', 'الرياض-الرئيسي-شارع صاري', 'فيزا' ,'2022,مايو,15 ', '120 ريال', 'البريد ',  '-----' , 'ملغي ', '---------'], 
                ['43356', 'محمد عبد الحميد', 'الرياض-الرئيسي-شارع صاري', 'ماستر' ,'2022,مايو,15 ', '120 ريال', 'البريد ',  '-----' , 'ملغي ', '---------'], 
                ['43356', 'محمد عبد الحميد', 'الرياض-الرئيسي-شارع صاري', 'تمارا' ,'2022,مايو,15 ', '120 ريال', 'البريد ',  ' FDSGTX ' , 'ملغي ', '---------'], 
                ['43356', 'محمد عبد الحميد', 'الرياض-الرئيسي-شارع صاري', 'ابل باي' ,'2022,مايو,15 ', '120 ريال', 'البريد ',  '-----' , 'ملغي ', '---------'], 
                ['43356', 'محمد عبد الحميد', 'الرياض-الرئيسي-شارع صاري', 'قوقل' ,'2022,مايو,15 ', '120 ريال', 'البريد ',  '-----' , 'ملغي ', '---------'], 
                ['43356', 'محمد عبد الحميد', 'الرياض-الرئيسي-شارع صاري', 'حوالة' ,'2022,مايو,15 ', '120 ريال', 'البريد ',  'GTRFS' , 'ملغي ', '---------'], 
                ['43356', 'محمد عبد الحميد', 'الرياض-الرئيسي-شارع صاري', 'نقدي' ,'2022,مايو,15 ', '120 ريال', 'البريد ',  '-----' , 'ملغي ', '---------'], 
                ['43356', 'محمد عبد الحميد', 'الرياض-الرئيسي-شارع صاري', 'مدى' ,'2022,مايو,15 ', '120 ريال', 'البريد ',  ' FDSGTX ' , 'ملغي ', '---------'], 
                ['43356', 'محمد عبد الحميد', 'الرياض-الرئيسي-شارع صاري', 'مدى' ,'2022,مايو,15 ', '120 ريال', 'البريد ',  '-----' , 'ملغي ', '---------'], 
                ['43356', 'محمد عبد الحميد', 'الرياض-الرئيسي-شارع صاري', 'مدى' ,'2022,مايو,15 ', '120 ريال', 'البريد ',  '-----' , 'ملغي ', '---------'], 
                ['43356', 'محمد عبد الحميد', 'الرياض-الرئيسي-شارع صاري', 'مدى' ,'2022,مايو,15 ', '120 ريال', 'البريد ',  '-----' , 'ملغي ', '---------'], 
           
                
            ]);
        
            // Add the worksheet to the workbook
            XLSX.utils.book_append_sheet(wb, ws, 'new-order');
        
            // Export the workbook to an Excel file
            XLSX.writeFile(wb, 'new-order.xlsx');
        }
        // ######## new order page ##########
        function exporuserPage() {
            var invoiceContent = document.getElementById('datatable6').outerHTML;        
            // Convert the HTML content to a worksheet
            var wb = XLSX.utils.book_new();
            var ws = XLSX.utils.aoa_to_sheet([
                ['رقم الموظف', 'اسم الكوظف','المنصب', 'تاريخ الانشاء' ,'اخر دخول','حضور الشهر', 'الساعات الاضافية ','غياب الشهر','الاجراءات' ],
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
                ['43356', 'محمد عبد الحميد', 'محررر manager', '2022,مايو,15 ' ,'2022,مايو,15 ', '23 ساعة', '55ساعة ',  ' 33 ساعة ','---------'], 
           
                
            ]);
        
            // Add the worksheet to the workbook
            XLSX.utils.book_append_sheet(wb, ws, 'users');
        
            // Export the workbook to an Excel file
            XLSX.writeFile(wb, 'users.xlsx');
        }
        // ######## user info page ##########
        function exportuserinfo() {
            var invoiceContent = document.getElementById('datatable7').outerHTML;        
            // Convert the HTML content to a worksheet
            var wb = XLSX.utils.book_new();
            var ws = XLSX.utils.aoa_to_sheet([
                ['اليوم', 'تسجيل الدخول','تسجيل الخروج', 'عدد ساعات العمل' ,'الحالة', 'ملاحظات '],
                ['01/03', ' 03:00 مساءا', '08:00 صباحا ', '9 ساعات' , 'حاضر', '---------'], 
                ['01/03', ' 03:00 مساءا', '08:00 صباحا ', '9 ساعات' , 'حاضر', '---------'], 
                ['01/03', ' 03:00 مساءا', '08:00 صباحا ', '9 ساعات' , 'حاضر', 'يتم ظهور الملاحظة هنا لإن وجد..'], 
                ['01/03', ' 03:00 مساءا', '08:00 صباحا ', '9 ساعات' , 'حاضر', '---------'], 
                ['01/03', ' 03:00 مساءا', '08:00 صباحا ', '9 ساعات' , 'حاضر', '---------'], 
                ['01/03', ' 03:00 مساءا', '08:00 صباحا ', '9 ساعات' , 'حاضر', '---------'], 
                ['01/03', ' 03:00 مساءا', '08:00 صباحا ', '9 ساعات' , 'حاضر', 'يتم ظهور الملاحظة هنا لإن وجد..'], 
                ['01/03', ' 03:00 مساءا', '08:00 صباحا ', '9 ساعات' , 'حاضر', '---------'], 
                ['01/03', ' 03:00 مساءا', '08:00 صباحا ', '9 ساعات' , 'حاضر', '---------'], 
                ['01/03', ' 03:00 مساءا', '08:00 صباحا ', '9 ساعات' , 'حاضر', '---------'], 
                ['01/03', ' 03:00 مساءا', '08:00 صباحا ', '9 ساعات' , 'حاضر', 'يتم ظهور الملاحظة هنا لإن وجد..'], 
                ['01/03', ' 03:00 مساءا', '08:00 صباحا ', '9 ساعات' , 'حاضر', '---------'], 
                ['01/03', ' 03:00 مساءا', '08:00 صباحا ', '9 ساعات' , 'حاضر', '---------'], 
                ['01/03', ' 03:00 مساءا', '08:00 صباحا ', '9 ساعات' , 'حاضر', '---------'], 
                ['01/03', ' 03:00 مساءا', '08:00 صباحا ', '9 ساعات' , 'حاضر', 'يتم ظهور الملاحظة هنا لإن وجد..'], 
                ['01/03', ' 03:00 مساءا', '08:00 صباحا ', '9 ساعات' , 'حاضر', '---------'], 
              
                
            ]);
        
            // Add the worksheet to the workbook
            XLSX.utils.book_append_sheet(wb, ws, 'usersinfo');
        
            // Export the workbook to an Excel file
            XLSX.writeFile(wb, 'usersinfo.xlsx');
        }
        // ######## clints page ##########
        function exportToExcelclintPage() {
            var invoiceContent = document.getElementById('datatable8').outerHTML;        
            // Convert the HTML content to a worksheet
            var wb = XLSX.utils.book_new();
            var ws = XLSX.utils.aoa_to_sheet([
                ['الاسم', 'الفرع','رقم الجزال', 'طريقة الدفع' ,'اجمالى الطلبات', 'طريقة الاستلام ', 'الكوبونات' , 'حالة الطلب '],
                ['اسم العميل', ' الرياض-الرئسي شارع صاري ', '+249 99999922', 'مدى' , '10', 'البريد' , 'PUYS44', ' تم التسليم'], 
                ['اسم العميل', ' الرياض-الرئسي شارع صاري ', '+249 99999922', 'مدى' , '10', 'البريد' , '------', ' ملغي'], 
                ['اسم العميل', ' الرياض-الرئسي شارع صاري ', '+249 99999922', 'مدى' , '10', 'البريد' , 'PUYS44', ' تم التسليم'], 
                ['اسم العميل', ' الرياض-الرئسي شارع صاري ', '+249 99999922', 'مدى' , '10', 'البريد' , '------', ' ملغي'], 
                ['اسم العميل', ' الرياض-الرئسي شارع صاري ', '+249 99999922', 'مدى' , '10', 'البريد' , 'PUYS44', ' تم التسليم'], 
                ['اسم العميل', ' الرياض-الرئسي شارع صاري ', '+249 99999922', 'مدى' , '10', 'البريد' , '------', ' ملغي'], 
                ['اسم العميل', ' الرياض-الرئسي شارع صاري ', '+249 99999922', 'مدى' , '10', 'البريد' , 'PUYS44', ' تم التسليم'], 
                ['اسم العميل', ' الرياض-الرئسي شارع صاري ', '+249 99999922', 'مدى' , '10', 'البريد' , '------', ' ملغي'], 
                ['اسم العميل', ' الرياض-الرئسي شارع صاري ', '+249 99999922', 'مدى' , '10', 'البريد' , 'PUYS44', ' تم التسليم'], 
                ['اسم العميل', ' الرياض-الرئسي شارع صاري ', '+249 99999922', 'مدى' , '10', 'البريد' , '------', ' ملغي'], 
                ['اسم العميل', ' الرياض-الرئسي شارع صاري ', '+249 99999922', 'مدى' , '10', 'البريد' , 'PUYS44', ' تم التسليم'], 
                ['اسم العميل', ' الرياض-الرئسي شارع صاري ', '+249 99999922', 'مدى' , '10', 'البريد' , '------', ' ملغي'], 
                ['اسم العميل', ' الرياض-الرئسي شارع صاري ', '+249 99999922', 'مدى' , '10', 'البريد' , 'PUYS44', ' تم التسليم'], 
                ['اسم العميل', ' الرياض-الرئسي شارع صاري ', '+249 99999922', 'مدى' , '10', 'البريد' , '------', ' ملغي'], 
               
                
            ]);
        
            // Add the worksheet to the workbook
            XLSX.utils.book_append_sheet(wb, ws, 'clits');
        
            // Export the workbook to an Excel file
            XLSX.writeFile(wb, 'clints.xlsx');
        }
        // ######## ratting page ##########
        function exportToExcelclintPage() {
            var invoiceContent = document.getElementById('datatable9').outerHTML;        
            // Convert the HTML content to a worksheet
            var wb = XLSX.utils.book_new();
            var ws = XLSX.utils.aoa_to_sheet([
                ['رقم الطلب', 'الاسم','الاجمالي', 'الفرع' ,'التقييم العام'],
                ['23232', ' بيرقر هيتا الاصلى المميز الجدي  اضافات:فلافل عادي: بابا غنوج عادي:اسكندراني عادي ', 'اجمالى  3434', 'الفرع الئيسي' , '4.0',], 
                ['23232', ' بيرقر هيتا الاصلى المميز الجدي  اضافات:فلافل عادي: بابا غنوج عادي:اسكندراني عادي ', 'اجمالى  3434', 'الفرع الئيسي' , '4.0',], 
                ['23232', ' بيرقر هيتا الاصلى المميز الجدي  اضافات:فلافل عادي: بابا غنوج عادي:اسكندراني عادي ', 'اجمالى  3434', 'الفرع الئيسي' , '4.0',], 
                ['23232', ' بيرقر هيتا الاصلى المميز الجدي  اضافات:فلافل عادي: بابا غنوج عادي:اسكندراني عادي ', 'اجمالى  3434', 'الفرع الئيسي' , '4.0',], 
                ['23232', ' بيرقر هيتا الاصلى المميز الجدي  اضافات:فلافل عادي: بابا غنوج عادي:اسكندراني عادي ', 'اجمالى  3434', 'الفرع الئيسي' , '4.0',], 
                ['23232', ' بيرقر هيتا الاصلى المميز الجدي  اضافات:فلافل عادي: بابا غنوج عادي:اسكندراني عادي ', 'اجمالى  3434', 'الفرع الئيسي' , '4.0',], 
                ['23232', ' بيرقر هيتا الاصلى المميز الجدي  اضافات:فلافل عادي: بابا غنوج عادي:اسكندراني عادي ', 'اجمالى  3434', 'الفرع الئيسي' , '4.0',], 
                ['23232', ' بيرقر هيتا الاصلى المميز الجدي  اضافات:فلافل عادي: بابا غنوج عادي:اسكندراني عادي ', 'اجمالى  3434', 'الفرع الئيسي' , '4.0',], 
                ['23232', ' بيرقر هيتا الاصلى المميز الجدي  اضافات:فلافل عادي: بابا غنوج عادي:اسكندراني عادي ', 'اجمالى  3434', 'الفرع الئيسي' , '4.0',], 
                ['23232', ' بيرقر هيتا الاصلى المميز الجدي  اضافات:فلافل عادي: بابا غنوج عادي:اسكندراني عادي ', 'اجمالى  3434', 'الفرع الئيسي' , '4.0',], 
                ['23232', ' بيرقر هيتا الاصلى المميز الجدي  اضافات:فلافل عادي: بابا غنوج عادي:اسكندراني عادي ', 'اجمالى  3434', 'الفرع الئيسي' , '4.0',], 
                         
            ]);
        
            // Add the worksheet to the workbook
            XLSX.utils.book_append_sheet(wb, ws, 'clits');
        
            // Export the workbook to an Excel file
            XLSX.writeFile(wb, 'ratting.xlsx');
        }
        // ######## cobon page ##########
        function exportToExcelcobonPage() {
            var invoiceContent = document.getElementById('datatable10').outerHTML;        
            // Convert the HTML content to a worksheet
            var wb = XLSX.utils.book_new();
            var ws = XLSX.utils.aoa_to_sheet([
                ['الرقم', 'اسم القسيمة','الكود', 'تاريخ البدء' ,'تاريخ الانتهاء','نسبة\ثابت','قيمة الخصم','قيمة الخصم فوق','المستخدمين','الاجراءات'],
                ['23232', ' اسم قسيمة راس السنة ', 'gaza', '2022,مايو,15 ' , '2022,مايو,15 ','مئوية','20%','130 رايال','120','مفعل','' ], 
                ['23232', ' اسم قسيمة راس السنة ', 'gaza', '2022,مايو,15 ' , '2022,مايو,15 ','ثابتة','20%','130 رايال','120','غير مفعل','' ], 
                ['23232', ' اسم قسيمة راس السنة ', 'gaza', '2022,مايو,15 ' , '2022,مايو,15 ','مئوية','20%','130 رايال','120','مفعل','' ], 
                ['23232', ' اسم قسيمة راس السنة ', 'gaza', '2022,مايو,15 ' , '2022,مايو,15 ','مئوية','20%','130 رايال','120','غير مفعل','' ], 
                ['23232', ' اسم قسيمة راس السنة ', 'gaza', '2022,مايو,15 ' , '2022,مايو,15 ','ثابتة','20%','130 رايال','120','مفعل','' ], 
                ['23232', ' اسم قسيمة راس السنة ', 'gaza', '2022,مايو,15 ' , '2022,مايو,15 ','مئوية','20%','130 رايال','120','غير مفعل','' ], 
                ['23232', ' اسم قسيمة راس السنة ', 'gaza', '2022,مايو,15 ' , '2022,مايو,15 ','ثابتة','20%','130 رايال','120','مفعل','' ], 
                ['23232', ' اسم قسيمة راس السنة ', 'gaza', '2022,مايو,15 ' , '2022,مايو,15 ','مئوية','20%','130 رايال','120','مفعل','' ], 
                ['23232', ' اسم قسيمة راس السنة ', 'gaza', '2022,مايو,15 ' , '2022,مايو,15 ','ثابتة','20%','130 رايال','120','مفعل','' ], 
                ['23232', ' اسم قسيمة راس السنة ', 'gaza', '2022,مايو,15 ' , '2022,مايو,15 ','ثابتة','20%','130 رايال','120','غير مفعل','' ], 
                ['23232', ' اسم قسيمة راس السنة ', 'gaza', '2022,مايو,15 ' , '2022,مايو,15 ','مئوية','20%','130 رايال','120','مفعل','' ], 
                        
            ]);
        
            // Add the worksheet to the workbook
            XLSX.utils.book_append_sheet(wb, ws, 'cobon');
        
            // Export the workbook to an Excel file
            XLSX.writeFile(wb, 'cobon.xlsx');
        }
        // ######## new reserv page ##########
        function exportToExcelreservPage() {
            var invoiceContent = document.getElementById('datatable13').outerHTML;        
            // Convert the HTML content to a worksheet
            var wb = XLSX.utils.book_new();
            var ws = XLSX.utils.aoa_to_sheet([
                ['رقم الحجز', 'تاريخ الحجز','بيانات العميل', 'رقم الوحدة' ,'حالة الحجز','الاجراءات'],
                ['23232', ' 2022,مايو,15  ', ' +23 993883993 اسم العميل', '77 ' ,  'مؤكد', 'تاكيد الحجز - تمت الزيارة - الغاء الحجز', ], 
                ['23232', ' 2022,مايو,15  ', ' +23 993883993 اسم العميل', '77 ' ,  'في الانتظار', 'تاكيد الحجز - تمت الزيارة - الغاء الحجز', ], 
                ['23232', ' 2022,مايو,15  ', ' +23 993883993 اسم العميل', '77 ' ,  'مكتمل', 'تاكيد الحجز - تمت الزيارة - الغاء الحجز', ], 
                ['23232', ' 2022,مايو,15  ', ' +23 993883993 اسم العميل', '77 ' ,  'مؤكد', 'تاكيد الحجز - تمت الزيارة - الغاء الحجز', ], 
                ['23232', ' 2022,مايو,15  ', ' +23 993883993 اسم العميل', '77 ' ,  'في الانتظار', 'تاكيد الحجز - تمت الزيارة - الغاء الحجز', ], 
                ['23232', ' 2022,مايو,15  ', ' +23 993883993 اسم العميل', '77 ' ,  'مؤكد', 'تاكيد الحجز - تمت الزيارة - الغاء الحجز', ], 
                ['23232', ' 2022,مايو,15  ', ' +23 993883993 اسم العميل', '77 ' ,  'في الانتظار', 'تاكيد الحجز - تمت الزيارة - الغاء الحجز', ], 
                ['23232', ' 2022,مايو,15  ', ' +23 993883993 اسم العميل', '77 ' ,  'مؤكد', 'تاكيد الحجز - تمت الزيارة - الغاء الحجز', ], 
                ['23232', ' 2022,مايو,15  ', ' +23 993883993 اسم العميل', '77 ' ,  'في الانتظار', 'تاكيد الحجز - تمت الزيارة - الغاء الحجز', ], 
                ['23232', ' 2022,مايو,15  ', ' +23 993883993 اسم العميل', '77 ' ,  'مؤكد', 'تاكيد الحجز - تمت الزيارة - الغاء الحجز', ], 
                ['23232', ' 2022,مايو,15  ', ' +23 993883993 اسم العميل', '77 ' ,  'في الانتظار', 'تاكيد الحجز - تمت الزيارة - الغاء الحجز', ], 
                ['23232', ' 2022,مايو,15  ', ' +23 993883993 اسم العميل', '77 ' ,  'في الانتظار', 'تاكيد الحجز - تمت الزيارة - الغاء الحجز', ], 
                ['23232', ' 2022,مايو,15  ', ' +23 993883993 اسم العميل', '77 ' ,  'مؤكد', 'تاكيد الحجز - تمت الزيارة - الغاء الحجز', ], 
                ['23232', ' 2022,مايو,15  ', ' +23 993883993 اسم العميل', '77 ' ,  'في الانتظار', 'تاكيد الحجز - تمت الزيارة - الغاء الحجز', ], 
                       
            ]);
        
            // Add the worksheet to the workbook
            XLSX.utils.book_append_sheet(wb, ws, 'new-reserve');
        
            // Export the workbook to an Excel file
            XLSX.writeFile(wb, 'new-reserve.xlsx');
        }
        // ######## old reserv page ##########
        function exportToExceloldreservePage() {
            var invoiceContent = document.getElementById('datatable14').outerHTML;        
            // Convert the HTML content to a worksheet
            var wb = XLSX.utils.book_new();
            var ws = XLSX.utils.aoa_to_sheet([
                ['رقم الحجز', 'تاريخ الحجز','بيانات العميل', 'رقم الوحدة' ,'اسم الموظف','حالة الطلب'],
                ['6656556', ' 14 مايو 2024 , 12:30AM  ', ' +23 993883993 اسم العميل', '77 ' ,  ' اسم الموظف , Employee Name', 'مكتمل', ], 
                ['6656556', ' 14 مايو 2024 , 12:30AM  ', ' +23 993883993 اسم العميل', '77 ' ,  ' اسم الموظف , Employee Name', 'ملغي', ], 
                ['6656556', ' 14 مايو 2024 , 12:30AM  ', ' +23 993883993 اسم العميل', '77 ' ,  ' اسم الموظف , Employee Name', 'مكتمل', ], 
                ['6656556', ' 14 مايو 2024 , 12:30AM  ', ' +23 993883993 اسم العميل', '77 ' ,  ' اسم الموظف , Employee Name', 'ملغي', ], 
                ['6656556', ' 14 مايو 2024 , 12:30AM  ', ' +23 993883993 اسم العميل', '77 ' ,  ' اسم الموظف , Employee Name', 'مكتمل', ], 
                ['6656556', ' 14 مايو 2024 , 12:30AM  ', ' +23 993883993 اسم العميل', '77 ' ,  ' اسم الموظف , Employee Name', 'ملغي', ], 
                ['6656556', ' 14 مايو 2024 , 12:30AM  ', ' +23 993883993 اسم العميل', '77 ' ,  ' اسم الموظف , Employee Name', 'مكتمل', ], 
                ['6656556', ' 14 مايو 2024 , 12:30AM  ', ' +23 993883993 اسم العميل', '77 ' ,  ' اسم الموظف , Employee Name', 'ملغي', ], 
                ['6656556', ' 14 مايو 2024 , 12:30AM  ', ' +23 993883993 اسم العميل', '77 ' ,  ' اسم الموظف , Employee Name', 'مكتمل', ], 
                ['6656556', ' 14 مايو 2024 , 12:30AM  ', ' +23 993883993 اسم العميل', '77 ' ,  ' اسم الموظف , Employee Name', 'ملغي', ], 
                       
            ]);
        
            // Add the worksheet to the workbook
            XLSX.utils.book_append_sheet(wb, ws, 'new-reserve');
        
            // Export the workbook to an Excel file
            XLSX.writeFile(wb, 'old-reserve.xlsx');
        }

/*
#############################################
## export invoice ass pdf file ##############
#############################################
*/ 
    // ##### print tbale one offer page to pdf
    $('#printTableBtn').click(function() {
        var $contentToExport = $('#tablecontent');

        // Ensure all images are fully loaded before printing
        var imagesLoaded = true;
        $contentToExport.find('img').each(function() {
            if (!this.complete) {
                imagesLoaded = false;
                $(this).on('load', function() {
                    if ($contentToExport.find('img').length === $contentToExport.find('img:complete').length) {
                        printContent();
                    }
                }).on('error', function() {
                    console.error('Image failed to load: ' + this.src);
                    if ($contentToExport.find('img').length === $contentToExport.find('img:complete').length) {
                        printContent();
                    }
                });
            }
        });

        if (imagesLoaded) {
            printContent();
        }

        function printContent() {
            var baseURL = window.location.origin;

            $('head').append('<base href="' + baseURL + '">');
            
            $contentToExport.printThis({
                importCSS: true,
                importStyle: true,
                loadCSS: [
                    "assets/css/lib/jquery.tagselect.css",
                    "assets/css/all.css",
                    "assets/css/style.css",
                    "style2.css",
                    "style3.css"
                ],
                printContainer: true,
                base: baseURL,
                //importCSS: true, // Import CSS for printing
                //importStyle: true, // Import <style> tags for printing
            // loadCSS: "path/to/your/custom.css", // Load additional CSS if needed
                pageTitle: "الطلبات المؤرشفة", // Page title for print
                header: false, // Optional header content
                //footer: null, // Optional footer content
            // base: false, // Override base path if necessary
            });

            $('base').remove();
        }
    });
    $('#printTableBtn1').click(function() {
        var $contentToExport = $('#datatable-1');

        // Ensure all images are fully loaded before printing
        var imagesLoaded = true;
        $contentToExport.find('img').each(function() {
            if (!this.complete) {
                imagesLoaded = false;
                $(this).on('load', function() {
                    if ($contentToExport.find('img').length === $contentToExport.find('img:complete').length) {
                        printContent();
                    }
                }).on('error', function() {
                    console.error('Image failed to load: ' + this.src);
                    if ($contentToExport.find('img').length === $contentToExport.find('img:complete').length) {
                        printContent();
                    }
                });
            }
        });

        if (imagesLoaded) {
            printContent();
        }

        function printContent() {
            var baseURL = window.location.origin;

            $('head').append('<base href="' + baseURL + '">');
            
            $contentToExport.printThis({
                importCSS: true,
                importStyle: true,
                loadCSS: [
                    "assets/css/lib/jquery.tagselect.css",
                    "assets/css/all.css",
                    "assets/css/style.css",
                    "style2.css",
                    "style3.css"
                ],
                printContainer: true,
                base: baseURL,
                //importCSS: true, // Import CSS for printing
                //importStyle: true, // Import <style> tags for printing
            // loadCSS: "path/to/your/custom.css", // Load additional CSS if needed
                pageTitle: "الطلبات المؤرشفة", // Page title for print
                header: false, // Optional header content
                //footer: null, // Optional footer content
            // base: false, // Override base path if necessary
            });

            $('base').remove();
        }
    });

    $('#printTableBtn2').click(function() {
        var $contentToExport = $('#datatable3');

        // Ensure all images are fully loaded before printing
        var imagesLoaded = true;
        $contentToExport.find('img').each(function() {
            if (!this.complete) {
                imagesLoaded = false;
                $(this).on('load', function() {
                    if ($contentToExport.find('img').length === $contentToExport.find('img:complete').length) {
                        printContent();
                    }
                }).on('error', function() {
                    console.error('Image failed to load: ' + this.src);
                    if ($contentToExport.find('img').length === $contentToExport.find('img:complete').length) {
                        printContent();
                    }
                });
            }
        });

        if (imagesLoaded) {
            printContent();
        }

        function printContent() {
            var baseURL = window.location.origin;

            $('head').append('<base href="' + baseURL + '">');
            
            $contentToExport.printThis({
                importCSS: true,
                importStyle: true,
                loadCSS: [
                    "assets/css/lib/jquery.tagselect.css",
                    "assets/css/all.css",
                    "assets/css/style.css",
                    "style2.css",
                    "style3.css"
                ],
                printContainer: true,
                base: baseURL,
                //importCSS: true, // Import CSS for printing
                //importStyle: true, // Import <style> tags for printing
            // loadCSS: "path/to/your/custom.css", // Load additional CSS if needed
                pageTitle: "الطلبات المؤرشفة", // Page title for print
                header: false, // Optional header content
                //footer: null, // Optional footer content
            // base: false, // Override base path if necessary
            });

            $('base').remove();
        }
    });

    // ##### print tbale on categorize page to pdf
    $('#printcategorize').click(function() {
        var $contentToExport = $('#datatable4');

        // Ensure all images are fully loaded before printing
        var imagesLoaded = true;
        $contentToExport.find('img').each(function() {
            if (!this.complete) {
                imagesLoaded = false;
                $(this).on('load', function() {
                    if ($contentToExport.find('img').length === $contentToExport.find('img:complete').length) {
                        printContent();
                    }
                }).on('error', function() {
                    console.error('Image failed to load: ' + this.src);
                    if ($contentToExport.find('img').length === $contentToExport.find('img:complete').length) {
                        printContent();
                    }
                });
            }
        });

        if (imagesLoaded) {
            printContent();
        }

        function printContent() {
            var baseURL = window.location.origin;

            $('head').append('<base href="' + baseURL + '">');
            
            $contentToExport.printThis({
                importCSS: true,
                importStyle: true,
                loadCSS: [
                    "assets/css/lib/jquery.tagselect.css",
                    "assets/css/all.css",
                    "assets/css/style.css",
                    "style2.css",
                    "style3.css"
                ],
                printContainer: true,
                base: baseURL,
                //importCSS: true, // Import CSS for printing
                //importStyle: true, // Import <style> tags for printing
            // loadCSS: "path/to/your/custom.css", // Load additional CSS if needed
                pageTitle: "الطلبات المؤرشفة", // Page title for print
                header: false, // Optional header content
                //footer: null, // Optional footer content
            // base: false, // Override base path if necessary
            });

            $('base').remove();
        }
    });

    // ##### print tbale on archive order page to pdf
    $('#printarchivorder').click(function() {
        var $contentToExport = $('#datatable5');

        // Ensure all images are fully loaded before printing
        var imagesLoaded = true;
        $contentToExport.find('img').each(function() {
            if (!this.complete) {
                imagesLoaded = false;
                $(this).on('load', function() {
                    if ($contentToExport.find('img').length === $contentToExport.find('img:complete').length) {
                        printContent();
                    }
                }).on('error', function() {
                    console.error('Image failed to load: ' + this.src);
                    if ($contentToExport.find('img').length === $contentToExport.find('img:complete').length) {
                        printContent();
                    }
                });
            }
        });

        if (imagesLoaded) {
            printContent();
        }

        function printContent() {
            var baseURL = window.location.origin;

            $('head').append('<base href="' + baseURL + '">');
            
            $contentToExport.printThis({
                importCSS: true,
                importStyle: true,
                loadCSS: [
                    "assets/css/lib/jquery.tagselect.css",
                    "assets/css/all.css",
                    "assets/css/style.css",
                    "style2.css",
                    "style3.css"
                ],
                printContainer: true,
                base: baseURL,
                //importCSS: true, // Import CSS for printing
                //importStyle: true, // Import <style> tags for printing
            // loadCSS: "path/to/your/custom.css", // Load additional CSS if needed
                pageTitle: "الطلبات المؤرشفة", // Page title for print
                header: false, // Optional header content
                //footer: null, // Optional footer content
            // base: false, // Override base path if necessary
            });

            $('base').remove();
        }
    });

    // ##### print tbale on new order page to pdf
    $('#printneworder').click(function() {
        var $contentToExport = $('#datatable6');

        // Ensure all images are fully loaded before printing
        var imagesLoaded = true;
        $contentToExport.find('img').each(function() {
            if (!this.complete) {
                imagesLoaded = false;
                $(this).on('load', function() {
                    if ($contentToExport.find('img').length === $contentToExport.find('img:complete').length) {
                        printContent();
                    }
                }).on('error', function() {
                    console.error('Image failed to load: ' + this.src);
                    if ($contentToExport.find('img').length === $contentToExport.find('img:complete').length) {
                        printContent();
                    }
                });
            }
        });

        if (imagesLoaded) {
            printContent();
        }

        function printContent() {
            var baseURL = window.location.origin;

            $('head').append('<base href="' + baseURL + '">');
            
            $contentToExport.printThis({
                importCSS: true,
                importStyle: true,
                loadCSS: [
                    "assets/css/lib/jquery.tagselect.css",
                    "assets/css/all.css",
                    "assets/css/style.css",
                    "style2.css",
                    "style3.css"
                ],
                printContainer: true,
                base: baseURL,
                //importCSS: true, // Import CSS for printing
                //importStyle: true, // Import <style> tags for printing
            // loadCSS: "path/to/your/custom.css", // Load additional CSS if needed
                pageTitle: "الطلبات المؤرشفة", // Page title for print
                header: false, // Optional header content
                //footer: null, // Optional footer content
            // base: false, // Override base path if necessary
            });

            $('base').remove();
        }
    });
    // ##### print tbale on user info page to pdf
    $('#printuserinfo').click(function() {
        var $contentToExport = $('#datatable7');

        // Ensure all images are fully loaded before printing
        var imagesLoaded = true;
        $contentToExport.find('img').each(function() {
            if (!this.complete) {
                imagesLoaded = false;
                $(this).on('load', function() {
                    if ($contentToExport.find('img').length === $contentToExport.find('img:complete').length) {
                        printContent();
                    }
                }).on('error', function() {
                    console.error('Image failed to load: ' + this.src);
                    if ($contentToExport.find('img').length === $contentToExport.find('img:complete').length) {
                        printContent();
                    }
                });
            }
        });

        if (imagesLoaded) {
            printContent();
        }

        function printContent() {
            var baseURL = window.location.origin;

            $('head').append('<base href="' + baseURL + '">');
            
            $contentToExport.printThis({
                importCSS: true,
                importStyle: true,
                loadCSS: [
                    "assets/css/lib/jquery.tagselect.css",
                    "assets/css/all.css",
                    "assets/css/style.css",
                    "style2.css",
                    "style3.css"
                ],
                printContainer: true,
                base: baseURL,
                //importCSS: true, // Import CSS for printing
                //importStyle: true, // Import <style> tags for printing
            // loadCSS: "path/to/your/custom.css", // Load additional CSS if needed
                pageTitle: "الطلبات المؤرشفة", // Page title for print
                header: false, // Optional header content
                //footer: null, // Optional footer content
            // base: false, // Override base path if necessary
            });

            $('base').remove();
        }
    });
    // ##### print tbale on clints page to pdf
    $('#printTclinttable').click(function() {
        var $contentToExport = $('#datatable8');

        // Ensure all images are fully loaded before printing
        var imagesLoaded = true;
        $contentToExport.find('img').each(function() {
            if (!this.complete) {
                imagesLoaded = false;
                $(this).on('load', function() {
                    if ($contentToExport.find('img').length === $contentToExport.find('img:complete').length) {
                        printContent();
                    }
                }).on('error', function() {
                    console.error('Image failed to load: ' + this.src);
                    if ($contentToExport.find('img').length === $contentToExport.find('img:complete').length) {
                        printContent();
                    }
                });
            }
        });

        if (imagesLoaded) {
            printContent();
        }

        function printContent() {
            var baseURL = window.location.origin;

            $('head').append('<base href="' + baseURL + '">');
            
            $contentToExport.printThis({
                importCSS: true,
                importStyle: true,
                loadCSS: [
                    "assets/css/lib/jquery.tagselect.css",
                    "assets/css/all.css",
                    "assets/css/style.css",
                    "style2.css",
                    "style3.css"
                ],
                printContainer: true,
                base: baseURL,
                //importCSS: true, // Import CSS for printing
                //importStyle: true, // Import <style> tags for printing
            // loadCSS: "path/to/your/custom.css", // Load additional CSS if needed
                pageTitle: "الطلبات المؤرشفة", // Page title for print
                header: false, // Optional header content
                //footer: null, // Optional footer content
            // base: false, // Override base path if necessary
            });

            $('base').remove();
        }
    });
    // ##### print tbale on rating table page to pdf
    $('#printratingtable').click(function() {
        var $contentToExport = $('#datatable9');

        // Ensure all images are fully loaded before printing
        var imagesLoaded = true;
        $contentToExport.find('img').each(function() {
            if (!this.complete) {
                imagesLoaded = false;
                $(this).on('load', function() {
                    if ($contentToExport.find('img').length === $contentToExport.find('img:complete').length) {
                        printContent();
                    }
                }).on('error', function() {
                    console.error('Image failed to load: ' + this.src);
                    if ($contentToExport.find('img').length === $contentToExport.find('img:complete').length) {
                        printContent();
                    }
                });
            }
        });

        if (imagesLoaded) {
            printContent();
        }

        function printContent() {
            var baseURL = window.location.origin;

            $('head').append('<base href="' + baseURL + '">');
            
            $contentToExport.printThis({
                importCSS: true,
                importStyle: true,
                loadCSS: [
                    "assets/css/lib/jquery.tagselect.css",
                    "assets/css/all.css",
                    "assets/css/style.css",
                    "style2.css",
                    "style3.css"
                ],
                printContainer: true,
                base: baseURL,
                //importCSS: true, // Import CSS for printing
                //importStyle: true, // Import <style> tags for printing
            // loadCSS: "path/to/your/custom.css", // Load additional CSS if needed
                pageTitle: "الطلبات المؤرشفة", // Page title for print
                header: false, // Optional header content
                //footer: null, // Optional footer content
            // base: false, // Override base path if necessary
            });

            $('base').remove();
        }
    });
    // ##### print tbale on rating table page to pdf
    $('#printcobontable').click(function() {
        var $contentToExport = $('#datatable10');

        // Ensure all images are fully loaded before printing
        var imagesLoaded = true;
        $contentToExport.find('img').each(function() {
            if (!this.complete) {
                imagesLoaded = false;
                $(this).on('load', function() {
                    if ($contentToExport.find('img').length === $contentToExport.find('img:complete').length) {
                        printContent();
                    }
                }).on('error', function() {
                    console.error('Image failed to load: ' + this.src);
                    if ($contentToExport.find('img').length === $contentToExport.find('img:complete').length) {
                        printContent();
                    }
                });
            }
        });

        if (imagesLoaded) {
            printContent();
        }

        function printContent() {
            var baseURL = window.location.origin;

            $('head').append('<base href="' + baseURL + '">');
            
            $contentToExport.printThis({
                importCSS: true,
                importStyle: true,
                loadCSS: [
                    "assets/css/lib/jquery.tagselect.css",
                    "assets/css/all.css",
                    "assets/css/style.css",
                    "style2.css",
                    "style3.css"
                ],
                printContainer: true,
                base: baseURL,
                //importCSS: true, // Import CSS for printing
                //importStyle: true, // Import <style> tags for printing
            // loadCSS: "path/to/your/custom.css", // Load additional CSS if needed
                pageTitle: "الطلبات المؤرشفة", // Page title for print
                header: false, // Optional header content
                //footer: null, // Optional footer content
            // base: false, // Override base path if necessary
            });

            $('base').remove();
        }
    });
    // ##### print tbale on new reserv table page to pdf
    $('#printTnewreservtable').click(function() {
        var $contentToExport = $('#datatable13');

        // Ensure all images are fully loaded before printing
        var imagesLoaded = true;
        $contentToExport.find('img').each(function() {
            if (!this.complete) {
                imagesLoaded = false;
                $(this).on('load', function() {
                    if ($contentToExport.find('img').length === $contentToExport.find('img:complete').length) {
                        printContent();
                    }
                }).on('error', function() {
                    console.error('Image failed to load: ' + this.src);
                    if ($contentToExport.find('img').length === $contentToExport.find('img:complete').length) {
                        printContent();
                    }
                });
            }
        });

        if (imagesLoaded) {
            printContent();
        }

        function printContent() {
            var baseURL = window.location.origin;

            $('head').append('<base href="' + baseURL + '">');
            
            $contentToExport.printThis({
                importCSS: true,
                importStyle: true,
                loadCSS: [
                    "assets/css/lib/jquery.tagselect.css",
                    "assets/css/all.css",
                    "assets/css/style.css",
                    "style2.css",
                    "style3.css"
                ],
                printContainer: true,
                base: baseURL,
                //importCSS: true, // Import CSS for printing
                //importStyle: true, // Import <style> tags for printing
            // loadCSS: "path/to/your/custom.css", // Load additional CSS if needed
                pageTitle: "الطلبات المؤرشفة", // Page title for print
                header: false, // Optional header content
                //footer: null, // Optional footer content
            // base: false, // Override base path if necessary
            });

            $('base').remove();
        }
    });
    // ##### print tbale on old reserv table page to pdf
    $('#printoldreservetable').click(function() {
        var $contentToExport = $('#datatable14');

        // Ensure all images are fully loaded before printing
        var imagesLoaded = true;
        $contentToExport.find('img').each(function() {
            if (!this.complete) {
                imagesLoaded = false;
                $(this).on('load', function() {
                    if ($contentToExport.find('img').length === $contentToExport.find('img:complete').length) {
                        printContent();
                    }
                }).on('error', function() {
                    console.error('Image failed to load: ' + this.src);
                    if ($contentToExport.find('img').length === $contentToExport.find('img:complete').length) {
                        printContent();
                    }
                });
            }
        });

        if (imagesLoaded) {
            printContent();
        }

        function printContent() {
            var baseURL = window.location.origin;

            $('head').append('<base href="' + baseURL + '">');
            
            $contentToExport.printThis({
                importCSS: true,
                importStyle: true,
                loadCSS: [
                    "assets/css/lib/jquery.tagselect.css",
                    "assets/css/all.css",
                    "assets/css/style.css",
                    "style2.css",
                    "style3.css"
                ],
                printContainer: true,
                base: baseURL,
                //importCSS: true, // Import CSS for printing
                //importStyle: true, // Import <style> tags for printing
            // loadCSS: "path/to/your/custom.css", // Load additional CSS if needed
                pageTitle: "الطلبات المؤرشفة", // Page title for print
                header: false, // Optional header content
                //footer: null, // Optional footer content
            // base: false, // Override base path if necessary
            });

            $('base').remove();
        }
    });
   






/**
 * ##########################################################
 * ## print invoice to pdf 
 * ##########################################################
*/
    // ########## invoice one  ########### //
    $('#invoice-archive-page').click(function() {
        var $contentToExport = $('#archive-invoice');

        // Ensure all images are fully loaded before printing
        var imagesLoaded = true;
        $contentToExport.find('img').each(function() {
            if (!this.complete) {
                imagesLoaded = false;
                $(this).on('load', function() {
                    if ($contentToExport.find('img').length === $contentToExport.find('img:complete').length) {
                        printContent();
                    }
                }).on('error', function() {
                    console.error('Image failed to load: ' + this.src);
                    if ($contentToExport.find('img').length === $contentToExport.find('img:complete').length) {
                        printContent();
                    }
                });
            }
        });

        if (imagesLoaded) {
            printContent();
        }

        function printContent() {
            var baseURL = window.location.origin;

            $('head').append('<base href="' + baseURL + '">');
            
            $contentToExport.printThis({
                importCSS: true,
                importStyle: true,
                loadCSS: [
                    "assets/css/lib/jquery.tagselect.css",
                    "assets/css/all.css",
                    "assets/css/style.css",
                    "style2.css",
                    "style3.css"
                ],
                printContainer: true,
                base: baseURL,
                //importCSS: true, // Import CSS for printing
                //importStyle: true, // Import <style> tags for printing
            // loadCSS: "path/to/your/custom.css", // Load additional CSS if needed
                pageTitle: "الطلبات المؤرشفة", // Page title for print
                header: false, // Optional header content
                //footer: null, // Optional footer content
            // base: false, // Override base path if necessary
            });

            $('base').remove();
        }
    });
    // ########## invoice tow new order   ########### //
    $('#nvoice-new-orderpage').click(function() {
        var $contentToExport = $('#new-order-invoice');

        // Ensure all images are fully loaded before printing
        var imagesLoaded = true;
        $contentToExport.find('img').each(function() {
            if (!this.complete) {
                imagesLoaded = false;
                $(this).on('load', function() {
                    if ($contentToExport.find('img').length === $contentToExport.find('img:complete').length) {
                        printContent();
                    }
                }).on('error', function() {
                    console.error('Image failed to load: ' + this.src);
                    if ($contentToExport.find('img').length === $contentToExport.find('img:complete').length) {
                        printContent();
                    }
                });
            }
        });

        if (imagesLoaded) {
            printContent();
        }

        function printContent() {
            var baseURL = window.location.origin;

            $('head').append('<base href="' + baseURL + '">');
            
            $contentToExport.printThis({
                importCSS: true,
                importStyle: true,
                loadCSS: [
                    "assets/css/lib/jquery.tagselect.css",
                    "assets/css/all.css",
                    "assets/css/style.css",
                    "style2.css",
                    "style3.css"
                ],
                printContainer: true,
                base: baseURL,
                //importCSS: true, // Import CSS for printing
                //importStyle: true, // Import <style> tags for printing
            // loadCSS: "path/to/your/custom.css", // Load additional CSS if needed
                pageTitle: "الطلبات المؤرشفة", // Page title for print
                header: false, // Optional header content
                //footer: null, // Optional footer content
            // base: false, // Override base path if necessary
            });

            $('base').remove();
        }
    });
    $('#total-invoice').click(function() {
        var $contentToExport = $('#total-invoices');

        // Ensure all images are fully loaded before printing
        var imagesLoaded = true;
        $contentToExport.find('img').each(function() {
            if (!this.complete) {
                imagesLoaded = false;
                $(this).on('load', function() {
                    if ($contentToExport.find('img').length === $contentToExport.find('img:complete').length) {
                        printContent();
                    }
                }).on('error', function() {
                    console.error('Image failed to load: ' + this.src);
                    if ($contentToExport.find('img').length === $contentToExport.find('img:complete').length) {
                        printContent();
                    }
                });
            }
        });

        if (imagesLoaded) {
            printContent();
        }

        function printContent() {
            var baseURL = window.location.origin;

            $('head').append('<base href="' + baseURL + '">');
            
            $contentToExport.printThis({
                importCSS: true,
                importStyle: true,
                loadCSS: [
                    "assets/css/lib/jquery.tagselect.css",
                    "assets/css/all.css",
                    "assets/css/style.css",
                    "style2.css",
                    "style3.css"
                ],
                printContainer: true,
                base: baseURL,
                //importCSS: true, // Import CSS for printing
                //importStyle: true, // Import <style> tags for printing
            // loadCSS: "path/to/your/custom.css", // Load additional CSS if needed
                pageTitle: "الطلبات المؤرشفة", // Page title for print
                header: false, // Optional header content
                //footer: null, // Optional footer content
            // base: false, // Override base path if necessary
            });

            $('base').remove();
        }
    });